Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 112, 120, 4)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 53, 57, 32)        8224      
_________________________________________________________________
batch_normalization (BatchNo (None, 53, 57, 32)        128       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 25, 27, 64)        32832     
_________________________________________________________________
batch_normalization_1 (Batch (None, 25, 27, 64)        256       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 12, 13, 64)        36928     
_________________________________________________________________
batch_normalization_2 (Batch (None, 12, 13, 64)        256       
_________________________________________________________________
flatten (Flatten)            (None, 9984)              0         
_________________________________________________________________
dense (Dense)                (None, 512)               5112320   
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 2052      
=================================================================
Total params: 5,192,996
Trainable params: 5,192,676
Non-trainable params: 320
_________________________________________________________________